Revit 2027 API
RebarConstraint.SetDistanceToTargetHostFace Method
 Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistanceToTargetHostFace(
	double offset
)
Public Sub SetDistanceToTargetHostFace (
	offset As Double
)
public:
void SetDistanceToTargetHostFace(
	double offset
)
member SetDistanceToTargetHostFace :
        offset : float -> unit
Parameters
offset Double
 The distance is given as an offset value, the sign of which depends on Host Face direction.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for offset must be no more than 30000 feet in absolute value.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace